# YOLO11n RGBT version 🚀

# Parameters
nc: 1  # number of classes
depth_multiple: 0.5
width_multiple: 1.0
max_channels: 512
# scales:
#   n: [0.50, 0.25, 1024]
anchors:
  - [6, 14, 10, 22, 14, 32]        # P3/8 - 사람 비율 2.3:1
  - [20, 46, 28, 64, 40, 92]       # P4/16 - 사람 비율 2.3:1  
  - [56, 128, 80, 184, 112, 256]   # P5/32 - 사람 비율 2.3:1

# RGBT backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, MultiStreamConv, [64, 6, 2, 2]]         # 0 - P1/2
  - [-1, 1, MultiStreamConv, [128, 3, 2]]           # 1 - P2/4
  - [-1, 2, MultiStreamC3, [256]]      # 2
  - [-1, 1, Fusion, ['concat', 2]]                  # 3 - fuse RGB + thermal stream
  - [-1, 1, Conv, [256, 3, 2]]                       # 4 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]                # 5
  - [-1, 1, Conv, [512, 3, 2]]                       # 6 - P4/16
  - [-1, 2, C3k2, [512, True]]                       # 7
  - [-1, 1, Conv, [1024, 3, 2]]                      # 8 - P5/32
  - [-1, 2, C3k2, [1024, True]]                      # 9
  - [-1, 1, SPPF, [1024, 5]]                         # 10
  - [-1, 2, C2PSA, [1024]]                           # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]          # cat backbone P4
  - [-1, 2, C3k2, [512, False]]        # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]          # cat backbone P3
  - [-1, 2, C3k2, [256, False]]        # 17

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]        # 20

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, False]]      # 23

  - [[17, 20, 23], 1, Detect, [nc, anchors]]